{"_id":{"$oid":"5c98e27b2dfcea3b0555b7dd"},"Module":[{"name":"S0 - Auto-formation orthographe et grammaire","scolaryear":2018,"description":"Pour aider les étudiants qui recherchent des pistes d’amélioration de la qualité de leurs écrits, le LabTxT d’EPITECH met à disposition des étudiants des ressources d’auto-formation sur l’E-learning. \n\nIl existe deux types de ressources d’auto-formation : \n-\u0009des fiches au format .pdf,\n-\u0009des mini-sites au format .html (une archive .rar qui contient un fichier index.html et tous ses fichiers annexes).\n\nLes ressources d'auto-formation ne sont pas des cours complets, elles ont pour but d’aider les étudiants à résoudre des difficultés ponctuelles (accord des participes passés, ne pas confondre à, a et as, etc.) en leur proposant quelques éléments d'information, des pistes de réflexion, des exercices pour s’entraîner. \n\nContrairement aux fiches en format .pdf, les mini-sites d’auto-formation (en .html) sont interactifs : il est possible de réaliser les exercices et de visualiser immédiatement les résultats.\n","credits":"0","status":"notregistered"},{"name":"S0 - Coaching libre","scolaryear":2018,"description":"Ce module ne sert qu'à formaliser des rendez-vous individuels proposés par le coach tout au long de l’année. \nIls sont décorrélés des rendez-vous en groupe organisés en première et deuxième année.","credits":"0","status":"notregistered"},{"name":"S0 - Coding Club","scolaryear":2018,"description":"Le Coding Club est un atelier récurrent qui permet aux lycéens de s’initier à la programmation et au développement. Il est disponible dans toutes les écoles Epitech de France ! Les ateliers d'apprentissage (stages durant les vacances, sessions le mercredi ou le samedi) sont animés par des étudiants d'Epitech : les CoBras\n\nCes étudiants passionnés se réunissent régulièrement au sein du Hub pour bidouiller, apprendre et faire découvrir des technologies variées (web, mobile, game, arduino…).\n\nCe module ne donnera pas lieu à l'attribution de crédits","credits":"0","status":"notregistered"},{"name":"S0 - Crédits obtenus dans un autre cursus","scolaryear":2018,"description":"This unit makes it possible to add credits to your current Epitech curriculum that have been obtained from other educational institutions or curriculum.","credits":"0","status":"notregistered"},{"name":"S0 - Ecriture de Fiction","scolaryear":2018,"description":"Module optionnel d'écrits de fiction ouvert à tous les étudiants (Tech1 à Tech5).\n\nCe module propose un projet par an, disponible lors de deux sessions (Session1 / Session 2), il n'est bien sûr possible que d'être noté une seule fois sur ce module.\n\nVos fictions doivent être de qualité publiable.\n\nCe projet vous donne l'occasion de laisser libre cours à votre imagination pour rédiger un texts selon un parcours ludique et créatif.\n\nVous réaliserez ce projet à partir d'une amorce de récit ou d'autres éléments (sons, images) procurés par le LabTxT dans les consignes.\n\nPour le rédiger, vous pouvez décider de vous associer quelle que soit votre promotion et la région EPITECH où vous suivez actuellement votre cursus d'études.\n\nLa taille du groupe d'étudiants est définie dans les consignes de chaque sujet. \n\n/!\\ Attention : ce module ne peut se poursuivre au delà de la fin de votre semestre de fin d'année d'études. Il sera clos pour votre conseil de classe.\n\nVous ne pouvez vous inscrire qu'à UNE SEULE SESSION  parmi les 2 proposées et pourrez obtenir ainsi au plus 1 crédit.","credits":"1","status":"notregistered"},{"name":"S0 - KYT/CAT - Cyber Security","scolaryear":2018,"description":"This unit is a roadblock in tek1 and in tek2 : you are expected to validate 1 cycle in Tek1, and 1 cycle in Tek2.\n\nThe purpose of this unit is to introduce you to some parts of computer culture and to instill and generate an interest in these various subjects. \n\nThe key word of this unit is \"serendipity\" meaning : ‘the fact of finding interesting or valuable things by chance’. By using recommended sources, the idea is to expand your research according to the topics you wish to address. \n\nThis unit is divided into several parts and it is essential that you understand how it works: \n\nEach cycle of KYTCAT (Know Your Tech/Crack A Trivia) includes 4 major areas of work and lasts 6 weeks. \n- The project registration gives you access to the resources that are the basis of the unit. \nThere will be some resources available to prepare your MCQ. Take the time to read, watch, and listen to these resources, they will be used as a base for the MCQ. \n\n- The MCQ’s on Moodle each include 20 different questions, concerning the contents of the resources. \nThis MCQ is the gateway to present your pitch. If your QCM score is not high enough, you can not go to the next step. \n\n- The pitch will be an opportunity for you to present a specific aspect of YOUR research, linked, of course, with the theme of the cycle. \nYou are to avoid factual presentations and instead seek analysis, synthesis and criticism. (duration: 10 min, Q/A included)\n\n- The written version will resume the main arguments of your pitch and will be in the form of an infographic, taking again the sources which you will have consulted to prepare your presentation. The purpose of this exercise is to provide a common basis to make available to students. \n\nAll these elements together will allow you to validate your unit. If you reach the minimum expected score from the first MCQ, you will be able to gain a +1 grade in the unit.","credits":"1","status":"notregistered"},{"name":"S0 - KYT/CAT - Network \u0026 Communication","scolaryear":2018,"description":"Ce module est barrage en Tek1 et en Tek2: il vous faut réussir un cycle au cours de chacune de ces 2 années.\n\nCe module a pour objectif de vous présenter quelques pans de culture informatique et de vous inculquer le réflexe de vous intéresser à des sujets variés.\n\nLe maître mot de ce module est \"sérendipité\", laissez-vous porter par les sources conseillées, puis étendez vos recherches en fonction des sujets que vous souhaitez aborder.\n\nCe module est divisé en plusieurs parties et il est indispensable que vous en compreniez le fonctionnement:\n\nChaque cycle de KYTCAT (Know Your Tech/Crack A Trivia) comprend 4 grands axes et dure 6 semaines.\n\n- L'inscription au projet vous donne accès aux ressources qui sont à la base du module. Il y aura là de la matière pour préparer votre QCM. Prenez le temps de lire, regarder, écouter ces sources, elles serviront de base au QCM.\n\n- Les QCM, sur Moodle, comprennent chacun 20 questions différentes, portant sur les contenus des ressources. Ce QCM est la porte d'entrée pour pouvoir présenter votre pitch. Si votre score à ce QCM n'est pas suffisant, vous ne pourrez pas accéder à l'étape suivante.\n\n- Le pitch sera pour vous l'occasion de présenter un aspect spécifique de VOS recherches, en lien, bien sûr, avec le thème du cycle. Vous éviterez les présentations platement factuelles, pour chercher l'analyse, la synthèse, la critique (durée 10 min, dont Q/R).\n\n- Le rendu écrit reprendra les principaux arguments de votre pitch et se présentera sous forme d'une infographie, en reprenant les sources que vous aurez consultées pour préparer votre présentation. L'objectif de ce rendu est de constituer une base commune à mettre à disposition des étudiants.\n\nTous ces éléments réunis vous permettront de valider votre module.\nSi vous atteignez le score minimum attendu dès le premier QCM, vous pourrez gagner +1 grade au module.","credits":"1","status":"notregistered"},{"name":"S0 - Extra Curricular Engagement","scolaryear":2018,"description":"Take a break regularly to decompress and share your skills with others!!!! :)\n\nThe credits for this unit are counted annually and, as such, will appear on the second semester’s transcripts. \n\nTo get your credits, you need to prove you are engaged in an association (whether about sport, music, theater or whatever you're intersted in).","credits":"1","status":"notregistered"},{"name":"B0 - English","scolaryear":2018,"description":"This cycle lasts 5 weeks.\n\nA presentation is organized to introduce you to the new English module.\n\nThe names of the projects are greek letters, the topics of the projects are written as subtitles.\n\nCycle 1 encompasses a limited number of projects.\nA kick off is organized on the first day of the cycle, to introduce the topics of the projects.\n\nEach project lasts 5 weeks: \n- 4 weeks of training and preparation (through workshop sessions, once a week);\n- 1 week of testing (through a delivery session). Test sessions may be individual or group evaluation, depending on the project. The goal is to check if you have acquired the skills expected from you (5 skills per project).\n\nOn top of that, you may be asked to register - or will be registered by the teacher - for Guidance meetings, once in the cycle.\n\nWhen necessary, you will take part in Cold Case sessions, where the teacher will help you tackle grammar or methodology difficulties.","credits":"1","status":"notregistered"},{"name":"B0 - English","scolaryear":2018,"description":"This cycle lasts 5 weeks.\n\nA presentation is organized to introduce you to the new English module.\n\nThe names of the projects are greek letters, the topics of the projects are written as subtitles.\n\nCycle 1 encompasses a limited number of projects.\nA kick off is organized on the first day of the cycle, to introduce the topics of the projects.\n\nEach project lasts 5 weeks: \n- 4 weeks of training and preparation (through workshop sessions, once a week);\n- 1 week of testing (through a delivery session). Test sessions may be individual or group evaluation, depending on the project. The goal is to check if you have acquired the skills expected from you (5 skills per project).\n\nOn top of that, you may be asked to register - or will be registered by the teacher - for Guidance meetings, once in the cycle.\n\nWhen necessary, you will take part in Cold Case sessions, where the teacher will help you tackle grammar or methodology difficulties.","credits":"1","status":"notregistered"},{"name":"B4 - Concurrent Programming","scolaryear":2018,"description":"In this unit we will tackle the concept of concurrent accesses via the following principles:\n        - thread and mutexs\n        - The IPC (semaphores, message queues etc.)","credits":"2","status":"notregistered"},{"name":"B4 - Functional programming","scolaryear":2018,"description":"Functional programming is a paradigm of programming that focuses on algorithms. In other words, it focuses on the evaluation of functions and the limits of the technical effects. We define a technical effect as something which modifies a function's execution environment. For example, a global affectation or writing on the standard output. In this way, in functional programming, we let the compiler handle the memory, the allocations and the code optimizations, which allows us to focus on the algorithms. \n\nFunctional programming and imperative programming are complementary. This is why properly mastering both paradigms will make you a better developer, one who is able to adapt to virtually any programming language. Furthermore, functional programming is a fundamental component of numerous other paradigms, like reactive programming.\n\nThis way of programming, often unfamiliar and unfairly considered to be \"too complicated\" or \"too detached from the reality of programming\", is, in fact, a boon for a programmer's knowledge. \n\nThere are numerous functional languages, which encourage this way of programming, like Haskell, OCaml, Scala, Erlang ou F#... it's a long list.  A number of imperative languages, like C++, Swift and JavaScript, now incorporate functional parts.\n\nYou will use Haskell, which has the huge quality of being a genuinely functional language, and offers a very comprehensive standard library and numerous external libraries. \n\nYou will find a lot of information about Haskell at the following address: http://haskell.org\n\nWarning: there's no such section as \"Functional programming\" in your E-learning. The exploitable learning resources will be indicated in the bootstrap documents.","credits":"4","status":"notregistered"},{"name":"B4 - Mathematics","scolaryear":2018,"description":"Probablilty and Statistics Unit.\n\nThis unit is the continuation of the units from B1 and B2. The skills required to validate the first two units need to have been acquired. You must be able to create algorithms by using mathematical methods, and be at ease with graphic tools (plotting different kinds of curves).    \n\nSUBJECTS COVERED:\nThe unit consists of two sections: 5 probability classes and 5 statistics classes. \n1° Probability: random experience, events, probabilité, random variables and a few famous discrete or continuous variable laws. \n2° Statistics: descriptive statistics, statistic adjustments, correlation, survey sampling.\n\nSKILLS TO BE ACQUIRED in order to validate the unit: \nThere are two types of skills required to validate the B4 unit:\n\n1° mastery of more complex scientific computing algorithms (formula decoding, combinatorial computing analysis, without intermediate storage in memory...)\n2° ability to manage complicated numerical calculations, which requires a good, preexisting comprehension and intelligent implementation (descriptive statistics parameters, correlation parameters, expected value and variance with numerical integration...). \n\nYou must be familiar with the fundamentals of probability and master several classic statistics methods. \nYou will be evaluated through the completion of 10 mini-projects. ","credits":"3","status":"notregistered"},{"name":"B4 - Network Programming","scolaryear":2018,"description":"All projects are to exclusively be done in C/UNIX, unless it is explicitly written otherwise in the subject.\n\nThis unit is specifically designed to introduce you to the following concepts: \n\n- Network communication\n- Data packets\n\nIn order to validate this unit, you must, through your project, demonstrate that you have acquired the following skills: \n\n- Multi-client programming\n- Communication protocol implementing\n- Documentation reading and understanding","credits":"4","status":"notregistered"},{"name":"B4 - Object-Oriented Programming","scolaryear":2018,"description":"The second year C++ course will introduce you to the Object Oriented Programming paradigm. \nWe will discuss modularization and problematic' abstraction by using practical examples such as dynamic libraries.\n","credits":"4","status":"notregistered"},{"name":"B4 - Shell Scripting","scolaryear":2018,"description":"Learn about Shell Script and how to use it, with a certain degree of complexity. \nThis is accomplished with a little project that has a few surprises. \n\nGrading is based on the ability to complete the shell scripts with a certain level of complexity, with command line argument management, escape mechanisms, familiarization with classic binaries (grep, cut, sed etc.). \n","credits":"1","status":"notregistered"},{"name":"B4 - Unix Prog. - Instrumentation","scolaryear":2018,"description":"This unit is the next installment of the nm/objdump and ASM x86-64 projects. It's going to enable you to have a better understanding of ELF files and reverse engineering. It will allow you to understand how debuggers and disassemblers function in UNIX.  \nThe various skills to be covered are: \n- discern the userland's kernel space;  \n- which information can be retrieved in a process; \n- explore the system call concept in greater depth; \n- learn how to plot a program's execution; \n- become an expert in Unix system programming; \n- learn how to decode x86-64 binary instructions. ","credits":"3","status":"notregistered"},{"name":"B4 - x86-64 Assembly","scolaryear":2018,"description":"Presentation of the x86-64 Assembly and the use of this low-level language for the development of a minimalistic C library.\n\nThe different covered subjects:\n- the x86-64 processor and its instruction set ;\n- memory and stack operation ;\n- address spaces and function calling ;\n- development of a mini-LibC in Assembly.","credits":"2","status":"notregistered"},{"name":"B4 - Year-End-Project - Zappy","scolaryear":2018,"description":"The second year C++ course will introduce you to the Object Oriented Programming paradigm. We will discuss modularization and problematic' abstraction by using practical examples such as dynamic libraries and threads when using the OOP paradigm.\n\n\n","credits":"4","status":"notregistered"},{"name":"B0 - English - TEPitech","scolaryear":2018,"description":"What is TEPitech? \n\nTEPitech stands for Test of English Proficiency at Epitech. It is a language exam you are supposed to take regularly throughout the year, until you pass it. It is an on-site automated exam, for which you need your computer, internet connection and headphones. Please note that the self-assessment exams are unsupervised sessions, whose sole purpose is to allow you to assess your progress. They won't count towards validating the unit.\n\nWhat is it for ?\n\nThis test is used to assess your English comprehension level, from year to year, in preparation for the 4th year abroad. Our partner universities expect you to have a minimum English level at the end of the 3rd year – at least 750/1000, but some of them would like higher scores.\n\nTherefore, the target scores are divided into 600 (tech1), 700 (tech2) and 750 (tech 3). The score has to be validated every year, even if you score 750 in tech1, you will still have to take the test in tech2 and tech 3.\n\nWhat does it look like?\n\nThe test is divided into two main parts (oral comprehension and written comprehension), which, in turn, are divided into several sections.\n\nYou’ll be tested on your comprehension, as well as on your grammar and vocabulary, in both business and academic domains.\n\nThe browsers that work best are Chrome/Chromium and Firefox.  Plug-ins and extensions are prohibited and students are requested to use full screen mode so that we can verify that no extensions or plug-ins are running. \n \nStudents who do not use Windows/Firefox etc. do so at their own risk.\n\nValidation specifications\n\nTerms and conditions\n\nTech1\n\nIn tech1, you need to score at least 600/1000 on the test before the end of the current academic year.\n\n* Credits\n\nThe TEPitech doesn’t give you any ECTS credits. The credits are counted toward the English unit.\n\n* Roadblock\n\nIn tech1, if you don’t score 600 on the TEPitech, you must validate enough language skills (see English unit) to prove that you’ve been working hard on your English. During tech1 you need to obtain at least 25 skills over the course of the academic year.\n\nLet’s recap:\n\n* 600 on TEPitech: no roadblock for tech2.\n\n* Less than 600 at the TEPitech, 25 skills validated, no roadblock for tech2, See below.\n\n* Less than 600 at the TEPitech, less than 25 skills validated, roadblock for tech2.\n\nLanguage training abroad\n\nIf, despite the workshops and the use of e-learning, you experience difficulties in improving your English level to meet the required standards, your local educational team may advise you to consider leaving for language training abroad. This doesn’t necessarily mean that you’ll have to attend English classes abroad. You are advised to look for a summer job in an English speaking country. When you come back, you’ll be asked to take a TEPitech in order to qualify for tech2.\n\nTech2\n\nIn tech2, you need to score at least 700/1000 on the test before the end of the current academic year.\n\n* Credits\n\nThe TEPitech doesn’t give you any ECTS credits. The credits are counted toward the English unit.\n\n* Roadblock\n\nIn tech2, if you don’t score 700 at the TEPitech, the unit becomes a roadblock: you cannot enter year 3. Remember- on top of that, you must validate enough language skills (see English unit) to prove that you’ve been working hard on your English. During tech2, you need to obtain at least 20 skills over the course of the academic year to gain your ECTS credits.\n\nLet’s recap:\n\n* 700 at TEPitech: no roadblock for tech3.\n\n* Less than 700 at the TEPitech: roadblock for tech3, See Sabbatical year.\n\nSabbatical year : Language training abroad\n\nIf, despite the workshops and the use of e-learning, you experience difficulties in improving your English level to meet the required standards, your local educational team may advise you to consider leaving for language training abroad during a sabbatical year. This doesn’t necessarily mean that you’ll have to attend English classes abroad. You are advised to look for a job in an English speaking country. When you come back, you’ll be asked to take a TEPitech in order to qualify for tech3.\n\nTech 3\n\nIn tech3, you need to score at least 750/1000 on the test before the end of the current academic year. Nevertheless, your application for Tech 4 is to be submitted at the end of January, so we advise you to score as high as possible by then.\n\n* Credits\n\nThe TEPitech doesn’t give you any ECTS credits. The credits are counted toward the English unit.\n\n* Roadblock\n\nIn tech3, if you don’t score 750 at the TEPitech, you cannot access Tech 4 and, subsequently, our partner universities. You must also validate enough language skills (see English unit) to prove that you’ve been working hard on your English. During tech3, you need to obtain at least 15 skills over the academic year.\n\nLet’s recap:\n\n* 750 at TEPitech: no roadblock for tech4.\n\n* Less than 750 at the TEPitech: roadblock for tech4, See below for sabbatical year.\n\nSabbatical year : Language training abroad\n\nIf, despite the workshops and the use of e-learning, you experience difficulties in improving your English level to meet the required standards, your local educational team may advise you to consider leaving for language training abroad during a sabbatical year. This doesn’t necessarily mean that you’ll have to attend English classes abroad. You are advised to look for a job in an English speaking country. When you come back, you’ll be asked to take a TEPitech in order to qualify for tech4.\n\nEnglish language skills:\n\nPlease read the description of the English module.","credits":"0","status":"ongoing"},{"name":"B0 - Hub","scolaryear":2018,"description":"There are 4 levels of investment in Hub activities:\n\n  - acculturation\n  - sharing\n  - experimentation\n  - fruition\n\n  There are several types of activities in the Hub, that you can witness, organize or even fully manage:\n\n  - HubTalk\n  Conference of a pro or student / former alumni on a tech subject generally held in the HUB (activities are planned on the HubTalk module - B-INN-001)\n  PARTICIPATION is about acculturation (1)\n  DOING IT is about sharing (1)\n\n  - Workshop\n  A few hours of experimentation to discover a tech project / concept\n  PARTICIPATION is about experimentation (1)\n  ORGANIZATION is about sharing (1)\n\n  - FocusGroup\n  A group of students focused on a technical project and offering demonstrations (including possible Workshops)\n  PARTICIPATION is about experimentation (2)\n  ORGANIZATION is about sharing (2)\n\n  - Hackaton / Jam\n Short-term (usually 1 weekend) challenges in or out of school\n  PARTICIPATION is about experimentation (2)\n\n  - Maker Projects\n  From the simple project of discovering something technical to an ambitious and published project, everything that takes the form of a concrete realization, alone or in a group\n  REALISATION is about fruition (1 to 2 depending on the size of the project)\n\nDepending on your academic year, total investment in these activities provides a number of credits:\n\n1 credit:  at least 4 acculturations and 3 experimentations\n3 credits: at least 4 acculturations, 3 experimentations and 1 fruition\n5 credits: at least 4 acculturations, 3 experimentations, 1 fruition and 1 sharing\n8 credits: at least 4 acculturations, 3 experimentations, 2 fruitions and 2 sharings\n\nThe Tech1 can validate 1, 3 or 5 credits (the \"8 credits\" option is not available);\nThe Tech2 can validate 3, 5 or 8 credits (the \"1 credit\" option is not available);\nThe Tech3 can validate 1, 3, 5 or 8 credits; they must commit at the beginning of the year in order to validate the \"Innovation\" Roadblock\n\nBONUS: The validated contribution to an open source project renamed during the year entitles you to 1 additional credit if you validate one of these steps (validated contribution == pull request).\n","credits":"0","status":"ongoing"},{"name":"B0 - Impact Jam","scolaryear":2018,"description":"Game Jam organisée par Epitech sur le thème des discriminations.\n\nPlanning :\n\nMardi 19 mars : Mini-formation et création des équipes\n    • 09h00 : Arrivée et accueil des participants\n    • 09h30 : Présentation de l'évènement\n    • 10h00 : Introduction au game design\n    • 10h30 : Atelier de game design : apprenez les bases de la conception de jeux !\n    • 11h00 : Comment un jeu peut-il avoir de l'impact social ?\n    • 11h15 : Pause\n    • 11h30 : Temps d'échange : s'engager à son envie et à sa mesure\n    • 12h00 : Présentation du sujet et des mentors\n    • 12h30 : Pause déjeuner en commun (1h)\n    • 13h30 : Quelques conseils pour la game jam\n    • 14h00 : Début de la formation des groupes et atelier d'idéation : du jeu à l'enjeu !\n    • dès 15h00 : Travail en autonomie avec les mentors associatifs et techniques à disposition pour vous accompagner\nMercredi 20 mars : Travail en groupes\n    • 09h-11h: Arrivée des équipes et travail en autonomie\n    • 11h12h30 : Passage des mentors dans les groupes : accompagnement, réponses aux questions\n    • 12h30 : Pause déjeuner en commun\n    • 13h30-15h : Second passage des mentors\n    • 15h30 : Optionnel : formation au pitch de projets à impact social\n    • Dès 16h : Travail en autonomie\n          ....et jusqu'au vendredi : finitions des projets !\nPrésentation des jeux : le vendredi 22 au soir.\n\nDiscord: http://discord.gg/qJeg5Rt\nKit de démarrage: http://bit.ly/kit_etudiants_impactjam","credits":"0","status":"ongoing"},{"name":"B0 - PCP Development","scolaryear":2018,"description":"Le développement personnel est un travail de toute une vie. C'est une façon de cerner ses compétences et qualités, ses objectifs dans la vie, et une manière de se fixer des buts, afin de réaliser et maximiser son potentiel.\nCe module votre aide à identifier les compétences dont vous avez besoin pour vous fixer des objectifs visant à améliorer vos perspectives d'employabilité, à augmenter votre confiance en vous, à améliorer la qualité de vie.\nPrenez les choses en main pour faire des choix positifs, efficaces et concrets dans votre vie, et pour prendre des décisions qui vous rendront maître de votre destin.\nCette page contient des informations et conseils pour vous encourager à réfléchir à votre développement personnel en termes d'objectifs et de potentiel.\nCe module s'articule autour de 3 grands axes:\n- le développement personnel\n- le développement collectif\n- le développement professionnel \nEn vous inscrivant à ce module, vous ne vous engagez pas à suivre la totalité des ateliers: sélectionnez ceux qui pourront vous aider à vous sentir mieux dans votre vie, vos études, votre travail.","credits":"2","status":"ongoing"},{"name":"S0 - Epices","scolaryear":2018,"description":"Ne vous inscrivez pas à ce module, vos points \"Epices\" seront convertis en crédits à la fin du semestre, et ce module sera alors mis à jour par l'ADM.\n\nMaximum de 6 crédits par an (soit 360 épices cumulées).\n\nVous pourrez collecter des épices tout au long de l'année grâce à vos activités associatives, vos participations aux évènements de l'école, aux actions de communication, à un coup de main ponctuel....","credits":"0","status":"ongoing"},{"name":"S0 - KYT/CAT - Processor Architecture","scolaryear":2018,"description":"This unit is a roadblock in tek1 and in tek2 : you are expected to validate 1 cycle in Tek1, and 1 cycle in Tek2.\n\nThe purpose of this unit is to introduce you to some parts of computer culture and to instill and generate an interest in these various subjects. \n\nThe key word of this unit is \"serendipity\" meaning : ‘the fact of finding interesting or valuable things by chance’. By using recommended sources, the idea is to expand your research according to the topics you wish to address. \n\nThis unit is divided into several parts and it is essential that you understand how it works: \n\nEach cycle of KYTCAT (Know Your Tech/Crack A Trivia) includes 4 major areas of work and lasts 6 weeks. \n- The project registration gives you access to the resources that are the basis of the unit. \nThere will be some resources available to prepare your MCQ. Take the time to read, watch, and listen to these resources, they will be used as a base for the MCQ. \n\n- The MCQ’s on Moodle each include 20 different questions, concerning the contents of the resources. \nThis MCQ is the gateway to present your pitch. If your QCM score is not high enough, you can not go to the next step. \n\n- The pitch will be an opportunity for you to present a specific aspect of YOUR research, linked, of course, with the theme of the cycle. \nYou are to avoid factual presentations and instead seek analysis, synthesis and criticism. (duration: 10 min, Q/A included)\n\n- The written version will resume the main arguments of your pitch and will be in the form of an infographic, taking again the sources which you will have consulted to prepare your presentation. The purpose of this exercise is to provide a common basis to make available to students. \n\nAll these elements together will allow you to validate your unit. If you reach the minimum expected score from the first MCQ, you will be able to gain a +1 grade in the unit.","credits":"1","status":"ongoing"},{"name":"S0 - Module Communication","scolaryear":2018,"description":"Actions communication de l'école : Forums et Conférences dans les lycées, JPO, Salons, etc.\n\nVenez participer aux actions de communication de l'école. Cela vous permettra d'acquérir de l'aisance à l'oral, de vous familiariser avec l'univers de la communication.   \nUn briefing est donné avant chaque action. \n\nCette fiche descriptive rassemble les évènements du campus parisien. Pour les actions spécifiques de votre ville, reportez-vous directement sur les activités de votre planning annuel ou hebdomadaire.\n\n","credits":"3","status":"ongoing"},{"name":"S0 - Security - Binary","scolaryear":2018,"description":"Binary Security:\n\nTOPICS COVERED: \n\nA study of the vulnerabilities associated with application development. A non-exhaustive list of areas covered:\n\n* Reverse Engineering:\n  * Anti-debugging techniques (Corrupted ELF format, stripped binaries, Packing, checksum on the binary itself, stack corruption, ptrace etc.)\n  * Different Architectures/Formats: Elf, PE, x86, x64, ARM  \n\n* Exploitation\n  * Vulnerabilities\n    * Buffer Overflow\n      * Stack Based\n      * Heap Based\n    * Integer Overflow\n    * Use after free\n    * Format string\n  * Techniques\n    * Debugging (r2 / GDB)\n    * Ret-to-X (code, libc etc.), Stack pivot, ROP\n    * Loading binaries (auxvv, GOT / PLT)\n    * Bypassing protections (NX, ASLR, ASCII-Armor etc.)\n    * Malloc Des-Maleficarum Houses\n\n\nTIMELINE: \n\nThere is only one project for this unit. Over the course of the project's duration, the goal is to take advantage of the weaknesses and obtain the permissions or informations for the infrastructures that were set up for the project. It is a platform in which groups of students compete and try to obtain the highest score, sometimes at the cost of the other teams.  \n\nBefore the project, a CFP will be held in order to organize short-talk sessions and student-lead workshops. \n\n\nVALIDATION CRITERIA: \n\nA broad knowledge of reverse and detecting and exploiting applicative vulnerabilities will be among the criteria needed to validate the unit. ","credits":"2","status":"ongoing"},{"name":"S0 - Security - Web","scolaryear":2018,"description":"Web Security -- SHODAN:\n\nSUBJECTS COVERED: \n\nStudy of vulnerabilities linked to the development of Web applications. \nNon-exhaustive list of domains we will cover:  \nAuthentification, ACL, configuration, cryptography, encoding, error management, protocols, synchronization, language traps, Web Services, injections.\n\n\nCLASS OUTLINE: \n\nThere is only one project for this unit: SHODAN.\nThroughout the duration of the project, the goal is to succeed in exploiting weaknesses and obtain privileges or information on sites set up for the project.\nIt's a platform on which groups of students will compete and look to obtain the highest score, sometimes at the cost of other teams.\nBefore the project, a CFP will take place in order to organize short-talk and workshop sessions that will be lead by students. \n\n\nVALIDATION CONDITIONS: \n\nSkill domains:\n- Web pentest environment \n- bruteforce technique, developing simple operations \n- Client security: XSS/CSRF/Phishing\n- Various injections: headers HTTP, SQL, URL, code, file, command\n\nGeneral knowledge of the detection and operation of these problems will be a condition to validate this unit.  ","credits":"2","status":"valid"},{"name":"B0 - English","scolaryear":2018,"description":"This cycle lasts 5 weeks.\n\nA presentation is organized to introduce you to the new English module.\n\nThe names of the projects are greek letters, the topics of the projects are written as subtitles.\n\nCycle 1 encompasses a limited number of projects.\nA kick off is organized on the first day of the cycle, to introduce the topics of the projects.\n\nEach project lasts 5 weeks: \n- 4 weeks of training and preparation (through workshop sessions, once a week);\n- 1 week of testing (through a delivery session). Test sessions may be individual or group evaluation, depending on the project. The goal is to check if you have acquired the skills expected from you (5 skills per project).\n\nOn top of that, you may be asked to register - or will be registered by the teacher - for Guidance meetings, once in the cycle.\n\nWhen necessary, you will take part in Cold Case sessions, where the teacher will help you tackle grammar or methodology difficulties.","credits":"1","status":"ongoing"},{"name":"B0 - English","scolaryear":2018,"description":"This cycle lasts 5 weeks.\n\nA presentation is organized to introduce you to the new English module.\n\nThe names of the projects are greek letters, the topics of the projects are written as subtitles.\n\nCycle 1 encompasses a limited number of projects.\nA kick off is organized on the first day of the cycle, to introduce the topics of the projects.\n\nEach project lasts 5 weeks: \n- 4 weeks of training and preparation (through workshop sessions, once a week);\n- 1 week of testing (through a delivery session). Test sessions may be individual or group evaluation, depending on the project. The goal is to check if you have acquired the skills expected from you (5 skills per project).\n\nOn top of that, you may be asked to register - or will be registered by the teacher - for Guidance meetings, once in the cycle.\n\nWhen necessary, you will take part in Cold Case sessions, where the teacher will help you tackle grammar or methodology difficulties.","credits":"1","status":"ongoing"},{"name":"B3 - C++ Seminar","scolaryear":2018,"description":"The C++ Seminar (or Pool) is a key moment in Epitech training. \nLike the C-Seminar unit, it is intensive and highly instructive.\n\nWe would advise you not to take it lightly and to work as seriously, and as consistently, as possible throughout the entire three weeks.\n\nTOPICS TO BE COVERED \nYou will discover object-oriented programming through the fundamental elements of the C++ language. Classes, instances and methods will (almost) no longer be a secret! \n\nSKILLS TO BE ACQUIRED in order to validate this unit:\n- Correct usage of the C++ language and its special features in relation to C.\n- The ability  to produce a basic C++ program in Unix.\n- The ability to wake up early, be punctual and work regularly\n- The ability to be precise in the reading, and comprehension, of one's code.\n","credits":"5","status":"ongoing"},{"name":"B3 - Internship","scolaryear":2018,"description":"This unit materializes your second year internship.","credits":"20","status":"valid"},{"name":"B4 - Administrative Meetings","scolaryear":2018,"description":"The goal of the Administrative Meetings unit is to keep you up-to-date concerning the administrative evolution of your academic career.\n\nThrough a various number of conferences, the pedagogical staff will recap the current status of the graduating class, the major events of the year and the best practices you should remember to follow.\n\nEnrollment in this unit is mandatory.","credits":"0","status":"ongoing"},{"name":"B4 - Computer Numerical Analysis - CryptoTrading","scolaryear":2018,"description":"Execution of the Trade project\n\nTHE PROJECT:\nThe goal of this project is to play around with stock market prices.\nIn other words, buying and selling stock according stock market's prices.\nOf course, just like in real life, you won't know which price the stock will have; it's an \"interactive\" system. \n\nGENERAL MAP :\nIn order to support you in achieving your own algorithm, this unit is made up of the following elements:\n - a first project to introduce THE most used tools in the stock market field for decision taking (sell/buy/wait).\n - a second project \"Trade\", that takes you to the elaboration of your own algorithm.\nThis project will be evaluated during a three-hour event, with a real-time stock market index, on which you'll have to apply your own algorithm and improve it live (dress up!)\nYou will be ranked according to your profits.","credits":"2","status":"ongoing"},{"name":"B4 - FR - Écrits professionnels","scolaryear":2018,"description":"Module obligatoire sur le cycle:\n\nVous devez valider 2 modules d'écrits professionnels du cursus Bachelor pour votre passage en Tek4.\n\n\n-------------------\nLe module B4 d'écrits professionnels comporte trois projets à réaliser :\nmail professionnel de recadrage d'un collègue, diaporama et bilan d'expérience.\nLes compétences sont validées sur la base de plusieurs projets réalisés.\n\nCes projets consistent à produire des documents écrits de qualité professionnelle. Il s'agit d'écrits variés.\nIls vous placent dans des situations différentes et vous préparent à savoir rédiger plus facilement et plus efficacement vos écrits professionnels.\n\nLes situations d'écriture de ce module sont: contrôler le ton dans un écrit professionnel, susciter l'intérêt, tirer le bilan d'une expérience professionnelle ou personnelle.\n\nChaque projet du module active des compétences rédactionnelles communes à tout écrit professionnel.\nDe plus, il vous permet de vous familiariser avec des techniques rédactionnelles spécifiques.\n\nChaque projet est précédé de cours consultables en libre accès sur l'E-Learning (Semestre 4 / B4-Expression écrite) et de TD de techniques rédactionnelles.\n\nEn complément, des suivis sont organisés à destination des étudiants qui ont des difficultés à surmonter en orthographe et en grammaire.\n\nDe plus, des ressources d’auto-formation sont mises à disposition des étudiants pour les aider à résoudre des difficultés ponctuelles (accord des participes passés, ne pas confondre à, a et as, etc.). \nCes ressources sont en libre accès sur l'E-learning (Semestre 0 / Auto-formation écrits professionnels).\n\nTout au long du module, vous aurez ainsi l'occasion d'acquérir des techniques rédactionnelles efficaces et de vous perfectionner pour écrire des documents pertinents.\n\nA la fin du module, vous devez être capable :\n\n1) d'écrire pour être lu et compris (s'adapter à son public et être clair)\n2) de contrôler le ton à adopter (en fonction de la situation, du destinataire, du type d'écrit)\n3) de susciter l'intérêt (savoir mettre en valeur quelqu'un ou quelque chose)\n4) de faire le bilan d'une expérience (prendre du recul, analyser, synthétiser)\n5) de livrer des écrits soignés (qualité de l'orthographe et clarté de la mise en page)\n\nVous serez évalué sur ces compétences lors de sessions d'évaluation planifiées auxquelles la présence est obligatoire.","credits":"2","status":"ongoing"},{"name":"B4 - Hub","scolaryear":2018,"description":"This unit does not include activities and is only intended to carry the credits obtained thanks to the activities carried by module \"B0 - Hub\"","credits":"3","status":"ongoing"},{"name":"B4 - Network and System Administration","scolaryear":2018,"description":null,"credits":"2","status":"ongoing"},{"name":"B4 - Professional Competencies","scolaryear":2018,"description":"This unit is mainly composed of review sessions.\n\nThe reviews allow you to present what you've done on a project, explain why you've done it this way and how you accomplished this result.\n\nThe code reviews allow you to share your programming experience and get feedbacks from peers. \n\n2 of the credits depends on your participation and quality of your reviews.\nTo gain 1 more credits, you must participate to at least 3 code reviews.","credits":"3","status":"ongoing"},{"name":"B4 - Unix Prog. - Memory","scolaryear":2018,"description":"Next installment of the first year's UNIX system programming unit. All projects are to be exclusively done in C/UNIXX (given that it's the next installment of the 1st year's PSU), except when explicitly stated otherwise in the subject:  \n\n- Memory allocation management (brk(2), sbrk(2), malloc project)\n\nIn order to validate this unit, you must show, through your project, that you have acquired the following skills: \n\n- Understanding of the mechanisms of memory management \n  (in particular the links between physical memory and virtual memory); \n- Understanding of the structure of a binary(ELF) file format \n","credits":"3","status":"fail"},{"name":"B4 - Year-End-Project - Indie Studio","scolaryear":2018,"description":"We will discuss modularization and problematic' abstraction by using practical examples such as dynamic libraries and threads when using the OOP paradigm.\n\n\n","credits":"4","status":"ongoing"}],"__v":0}
